<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest FileMaker Pro (Claris) full installer given the supplied PRODUCT_ID and imports it into a munki_repo.

To use this recipe, go to https://www.filemaker.com/redirects/ss.txt and find the desired product in the list (ex. PRO19MAC). Enter this value for PRODUCT_ID.</string>
    <key>Identifier</key>
    <string>com.github.apizz.munki.FileMakerProClaris</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Software</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/filemakerpro</string>
        <key>PRODUCT_ID</key>
        <string>PROADV18MAC</string>
        <key>NAME</key>
        <string>FileMakerPro</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Claris International Inc.</string>
            <key>description</key>
            <string>Take on digital transformation with Claris FileMaker. Quickly build custom apps that solve your business problems today — and tomorrow. Accelerate your business, unlock your team’s creative potential, and drive to better outcomes.</string>
            <key>display_name</key>
            <string>FileMaker Pro</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.FileMakerProClaris</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
